vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE245_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXE245_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXE245</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXE245" Dvendor="NXP:11">
      <description>MCXE245</description>
      <device Dname="MCXE245">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="0"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXE245/iar/MCXE245_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x010000" access="rx" default="1"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x1000" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fff8000" size="0x8000" access="rw" default="1"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x7000" access="rw" default="1"/>
        <algorithm name="devices/MCXE245/arm/MCXE245_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x1fff8000" RAMsize="0x0000f000" default="1"/>
        <debug svd="devices/MCXE245/MCXE245.xml"/>
        <variant Dvariant="MCXE245VLF">
          <compile header="devices/MCXE245/fsl_device_registers.h" define="CPU_MCXE245VLF"/>
        </variant>
        <variant Dvariant="MCXE245VLH">
          <compile header="devices/MCXE245/fsl_device_registers.h" define="CPU_MCXE245VLH"/>
        </variant>
        <variant Dvariant="MCXE245VLL">
          <compile header="devices/MCXE245/fsl_device_registers.h" define="CPU_MCXE245VLL"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXE245.internal_condition">
      <accept Dname="MCXE245VLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE245VLH" Dvendor="NXP:11"/>
      <accept Dname="MCXE245VLL" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXE245.internal_condition">
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MCXE245.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MCXE245.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_lpspi.condition_id">
      <require condition="allOf.driver.lpspi, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device=MCXE245.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.anyOf=driver.port, driver.gpio, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.port, driver.gpio, device=MCXE245.internal_condition">
      <require condition="anyOf.driver.port.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MCXE245.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MCXE245.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MCXE245.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MCXE245.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MCXE245.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE245.internal_condition"/>
    </condition>
    <condition id="component.lpspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpspi, device=MCXE245.internal_condition"/>
    </condition>
